Revit 2026 API

# SystemNavigatorFailures Properties

---

The BuiltInFailuresSystemNavigatorFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannottFindCorrectTreeNode | Can't find the correct tree node in system browser according to the node index. |
|  | MultipleSelectNumberIsWrong | The selected tree nodes number of system browser is wrong. |

#### Reference

BuiltInFailuresSystemNavigatorFailures Class

Autodesk.Revit.DB Namespace